/**
 *
 * 文件名: Game.c
 * 描  述: 完成Game.h
 * 作  者: 大鱼
 *
 **/
#include "Game.h"
#include "GameLib.h"
/* 游戏界面宽度80 */
#define SEP "------------------------------------------------------------------------------"
int X=2,Y=3;
Player players[]={
/*  编号 名字   密码  hp hp上限 mp mp上限 等级 经验 金币   坐标     背包初始化*/
    {1,"流氓兔","tuzi",70000,10000,200,10000, 1, 67, 100000,{4,4},.bag.count=0,.bag.max=36},
    {2,"阎君","yanwang",5000,100000,5000,100000, 9, 844, 100000,.coord.X=2,.coord.Y=0,.bag.count=0,.bag.max=36},
};
Martial martials[] = {
    {1,"雪剑派","太古","太古小江湖中岛的门派，太古小江湖十小门派家族之一，主修冰系心法，招式以剑术为主。靠山为乾坤门，但冰无情掌权后开始脱离乾坤门，天阶岛雪剑派有关。因冰无情和冷冷的关系而成为青云门的盟友",{3,3}},
    {2,"叶灵派","太古","太古小江湖中岛的门派，太古小江湖十小门派家族之一，招式灵感来源于叶子，在十小门派家族中相对弱势，靠山是启天派。因端木玉的关系而成为青云门的盟友",{3,3}},
    {3,"楚家","太古","太古小江湖中岛的家族，家主为新晋元婴，表面上底蕴不足，实际上是在隐藏实力。擅长使用影子系武技，是六合派功法的克星。因楚天路之故而成为青云门的盟友。现因打败六合派而晋升十小门派家族",{3,3}},
    {4,"冲天门","太古","太古小江湖北岛三大门之一，太古小江湖十小门派家族之一，有两个元婴老怪，与天阶岛冲天阁有关",{2,1}},
    {5,"辟邪门","太古","太古小江湖南岛的门派，太古小江湖十小门派家族之一，喜欢元神体的邪派，其功法邪门能克制元神体和神识招式，能吞噬元神体进行修炼。靠山为太古五行门",{1,2}},
    {6,"引云派","太古","太古小江湖十小门派家族之一，靠山为乾坤门.",{1,2}},
    {7,"奥田家族","太古","太古小江湖十小门派家族之一，靠山为乾坤门，疑似与天阶岛奥田家族有关。",{1,2}},
    {8,"太古明日复明日教派","太古","太古小江湖中的明日复明日教派，太古小江湖十小门派家族之一。",{1,2}},
    {9,"乾坤门","太古","太古小江湖南岛的门派，原太古小江湖四大门派家族之首。占据太古山脉四个方向之一，一家客栈股东之一，曾重创千刃派，还打残太古不败。拥有七个元婴期，但因与林逸作对而伤亡惨重（只剩两个）。现已被青云门取代并跌落十小",{1,2}},
    {10,"启天派","太古","太古小江湖中的门派，原太古小江湖四大门派家族之一，占据太古山脉四个方向之一，一家客栈股东之一。叶灵派的靠山，但对叶灵派不怎么待见。疑似是《极品修真强少》中的启天门前身。暗中早已投靠中心。现已被千刃派取代，跌落十小",{3,3}},
    {11,"青云门","太古","太古小江湖北岛三大门之一，原太古小江湖十小门派家族之一，现已被林逸接管。拥有天阶岛青云阁的残缺心法《青云平心诀》，与天阶岛青云阁有关。现在林逸的管理下实力大增。在太古盛会上取代乾坤门成为四大门派家族之首",{2,1}},
    {12,"上官家族","太古","太古小江湖的家族，太古小江湖四大门派家族之一，占据太古山脉四个方向之一，一家客栈股东之一。弱势已久，只拥有三位元婴期。与北岛三大门素有渊源，曾是北岛三大门的靠山。拥有天阶岛上官家的残缺心法《万字真言》，与上官天华的家族有关。",{3,3}},
    {13,"千刃派","太古","太古小江湖中岛的门派，原为太古小江湖四大门派家族之一，但其祖师太古不败离开后被乾坤门重创而没落为普通门派，擅长同时操控多件兵器。太古不败被打残后解散，后在林逸的帮助下复兴，与青云门是盟友。在太古盛会上异军突起，已取代启天派，重返四大",{3,3}},
    {14,"太古五行门","太古","太古小江湖中的五行门，太古小江湖四大门派家族之一，占据太古山脉四个方向之一，一家客栈股东之一。是炼丹大派，实力只比乾坤门略逊一筹。",{3,3}},
    {15,"玄机门","太古","太古小江湖北岛三大门之一，由于该门元婴老怪下落不明已被十小门派家族除名。因上官家族太过弱势而改投太古五行门。后因青云门之故而被新靠山抛弃，接着又不被其他四大接纳成为而太古小江湖中的大笑话，后因洪玄雷被迫让位下重返北岛联盟。与天阶岛玄机阁有关",{2,1}},
    {16,"霸刀门","太古","太古小江湖中岛的门派，靠山为乾坤门，与千刃派是世仇。擅长使用大刀，能发出刀势，但功法不完整，刀尖处存在破绽。太古盛会时得到乾坤门的大力扶持，并打败轩羽门晋升十小门派家族，但遭千刃派打败而失去十小位置",{3,3}},
    {17,"六合派","太古","原太古小江湖十小门派家族之一，太古小江湖中少有不怎么使用兵器的门派，能将对手困在自己的真气阵势中。现遭楚家打败而失去十小门派家族的位置。",{3,3}},
    {18,"轩羽门","太古","原太古小江湖十小门派家族之一，如今遭霸刀门打败而失去十小门派家族的位置",{2,1}},
    {19,"三才门","太古","太古小江湖的门派。实力比不上霸刀门",{1,2}},
    {20,"三海门","太古","太古小江湖的门派。实力比不上霸刀门",{1,2}},
    {21, "少林派",   "正派", "中华武学的泰斗，明末，少林众多的人才中，以悟空和箭神二人排为一等。其中，悟空出家为僧，箭神乃俗家弟子。当时江湖人称少林双绝。少林寺中众僧在两大长老的带领下参加了江浙沿海抗击倭寇的战斗，在各路应募兵马中表现得最为骁勇。但正因抗倭之事，也使江湖中的众多门派产生了矛盾，其中首推少林和日月神教。悟空、箭神曾几度带领江湖同仁攻上光明顶，但由于日月神教和血河两派结为同盟，更何况邪派中高手如云，所以几次围剿未果而终，黑白两道都损失惨重" ,.hqCoord.X=1, .hqCoord.Y=4},
    {22, "武当派",   "正派", "武当在江湖上与少林齐名，有‘北崇少林’‘南尊武当’之说。 武当新一代的首领人物，是一位谦谦君子，一张轮廓分明的脸上总是带着爽朗的笑容，就连他的仇敌都不能不承认他是条少见的男子汉。凡人从十八岁崛起江湖，身经大小三十三战，至今从未败过一次。凡人一生中最不能忍受的两件事就是失败和错误。 ",{3,4}},
    {23, "丐帮",     "正派", "丐帮是中原武林中人数最为众多的一个门派，也是天下第一大帮派，以遍布天下乞丐的乞丐组成，分为污衣帮和净衣帮。丐帮中人大多都是社会地位比较低的人，但他们各个铮铮硬骨，品格高尚，很少出现卑劣之人。丐帮新一代众多弟子以天葵为首，除暴安良、行侠丈义、抑强扶弱，所作所为为天下人所津津乐道。",{2,6}},
    {24, "全真教",   "正派", "全真属于道教的分支之一。现今全真教中最有权威的人是一个瘦瘦小小的人，长着一双冷冷淡淡好象永远不会有什么变化的眼睛，看起来仿佛是灰色的。但他又是一个非常讲究的人，他喜欢紫色，喜欢名马佳人华衣美酒，喜欢享受。对每一件事情他都非常的挑剔，做的每一件事都经过精密计划，绝不肯多浪费一分力气，也不会有一点疏忽。这就是全真海雅。",{2,3}},
    {25, "五岳剑派", "正派", "泰山派，恒山派，衡山派，华山派，嵩山派结为同气枝连的的五岳剑派，在江湖上扬名立万。五派中人一向面和心不和，所以五派的式微不是由于外敌入侵，而纯粹是内部矛盾激化走向内耗的结果，内部的勾心斗角虽然常常以抗倭为借口出现，实则是为了掌握五岳生杀大权。",{1,3}},
    {26, "四川唐门", "正派", "唐门在江湖上以暗器闻名。但自从唐门的唐老太太过世后唐家堡一度家道中落，加之唐甜为称霸武林挑起纷争，又使唐门陷入了再度的浩劫，几乎一蹶不振。在这种危难的时刻唐门出现了一群新生力量：唐纾、唐斩、唐缺、唐玉。他们整顿内务，肃清奸佞，打出了匡复武林正义的旗帜，并且在江湖上行侠仗义，挽回了唐门的声誉，使唐门成为了江湖上的名门正派。",{2,2}},
    {27, "大理段氏", "正派", "大理段氏人丁众多，高手如云。其中有一位名扬江湖顶尖女侠——香雪儿。香雪儿面相灵秀，肤色白皙，但微显瘦弱，看上去弱不禁风却身怀绝世武功，已深得大理武功心得。",{5,1}},
    {28, "天山派",   "正派", "天山派是名门正派，也是目前江湖中最为团结的一个门派。天山派也是江湖中女弟子最为众多的一个门派，且各个武功造诣不凡，相貌清秀。",{0,0}},
    {29, "古墓派",   "正派", "古墓派这一代的传人名叫暄雯，是一女子，来历不明。暄雯生性娴静，长相俊美，举止飘逸，但做事情却不似师祖小龙女，倒颇有一点杨过的风格，武功修为深不可测，同样喜穿白衣。此派轻功卓越，剑法、拳法灵动妙绝，更是全真教的克星。古墓传人的处世原则是“事不关己，高高挂起”，过着与世无争的日子，但是如果有人冒犯了古墓传人，那他一定会死得很惨。",{3,3}},
    {30, "名捕门",  "正派", "名捕门历属与官府，但其中也不乏在江湖上闯出名堂的武林高手。名捕门一等一的人才中有一位绰号叫‘惊天泣鬼’的，此人从不以真面目视人，总是在幕后策划一些事情。",{1,1}},
    {31, "日月神教","邪派", "由于该教高手众多，并彼此互不相服，所以教务混杂。教中弟子多为邪恶之徒，专与名门正派作对，杀人良多，罪恶昭彰，故被江湖正派之人贬为魔教。",{6,1}},
    {32, "权力帮",  "邪派", "邪派之一，目前派中最高首脑为一叫阿飞的年轻人。阿飞，一个表面上异常忧悒的人。没有与其交过手的武林高手，无法想象他那弱不禁风的身躯隐藏着那么大的潜力，更不能想象他是如何用支撑起权利帮的担子的。",{4,0}},
    {33, "五毒教",  "邪派", "一个以使毒为专长的门派，派中人各个都是用毒高手。此派高手人称梦魇，其人使毒已入化境，令人难以琢磨，江湖同道对其莫不绕道而行。此人品行时好时坏，但坚韧卓绝，嗜武成痴。",{2,0}},
    {34, "神龙教",  "邪派", "神龙教是江湖邪派，由于教址远离中原，所以不大干预中原武林的血腥杀戮。目前神龙教有两位高手一为刀神，此人武功高深莫测，性格孤僻冷傲，不喜与人接近。二为恶龙，武功高强但脾气暴躁，做事没有耐性。",{2,7}},
    {35, "青龙会",  "邪派", "江湖上绵延数百年的一个神秘组织。青龙会下分十二堂，分别以月为代号。",{5,6}},
    {36, "桃花岛",  "亦正亦邪", "自从东邪黄药师扬名立万于此后，他的传人就在这里绵延不绝，竟将桃花岛建成了门派的总舵。桃花岛黄药师的关门弟子程英一生未嫁，在岛上收了几个徒弟，桃花岛的武功因此得到延续和发扬。",{4,7}},
    {37, "锦衣卫",  "亦正亦邪", "大内锦衣卫中人才济济，尤其是雷神，此人野心勃勃，自幼练得一身大力金刚功，号称刀枪不入，武功实是深不可测。而且为人机智，精通兵法，行兵时能将千军万马人使得如同数十万般威力十足。",{1,5}},
    {38, "血河派",  "亦正亦邪", "自从血河派的掌门一代大侠方歌吟飘然而去后，血河派日益衰落。血河派活动的范围也越来越少，基本上只限与龙门石窟。而江湖上的九大门派已经把血河派视为邪魔歪道。并已传出英雄令，只要九大门派的门人遇上血河派的人，一律格杀无论。在江湖上已经没有什么血河派的人在行走。除了无恨！没有人知道他来自何方，人们只知道他来自血河派。没有人知道他的武功有多高，因为看见他的剑的人都已经......无恨是武林中的一个谜，现隐居在天山，相传是为了一名叫若寒的女子。相传血河弟子花无缺已深得无恨真传，在无恨隐居江湖期间代理血河的一切帮中事务。花无缺为人善良真诚，在江湖上人缘甚好，并将血河派内外事务打理得井井有条。",{5,0}},
    {39, "通通吃",  "亦正亦邪", "江湖上一个神秘的门派，创始人，武功不祥。总舵设在通吃岛，教中首领人物——辉翰。此人手段严酷，以威服人。平常不轻易踏足中原武林，潜心修炼武功。",{7,3}},
    {40, "玩偶山庄","亦正亦邪", "江湖上一个神秘的门派，创始人，武功不祥。总舵就在玩偶山庄，教中首领人物——阳光。玩偶山庄门人众多，但大都绝迹江湖，只有阳光经常独自浪迹江湖并闯出了名堂，所以武林中人才知有这么一个门派存在。",{0,6}}
    };
Monster monsterArray[] = {
/*  编号 名字  等级 hp atk def 金币 exp 存活 */
    {1,"无主之魂",1,100,5,2,10,5,1,{0,0}},
    {2,"504骚东西",2,150,6,3,15,5,1,{0,0}},
    {3,"504骚家伙",3,200,7,4,20,5,1,{0,0}},
    {4,"504骚话王",4,250,8,5,25,5,1,{0,0}},
    {5,"504CEO",5,300,9,6,30,5,1,{0,0}},
};
Prop propArray[] = {
/* 编号  名称  级别 库存 单价  类型           ~~~效果~~~      功能描述 */
    {1, "见习小剑", 1, 99, 1, Weapon,.Attack=1,"新手装备，人人有份"},
    {2, "见习布衣", 1, 99, 1, Armor,.Defence=1,"新手装备，人人有份"},
    {3, "轩辕剑", 3, 2, 10000, Weapon,.Attack=50,"黄金色之千年古剑，传说是天界诸神赐予轩辕皇帝击败蚩尤之旷世神剑；其内蕴藏无穷之力，为斩妖除魔的神剑。"},
    {4, "东皇钟", 7, 2, 10000, Armor,.Defence=50,"下落不明，力量不明。一般传闻它是天界之门，但据天山石窟中诸神时代残留之古老壁文记载：东皇钟乃十大神器力量之首，足以毁天灭地、吞噬诸天。"},
    {5, "女娲石", 1, 2, 10000, Con,.Power=125,"人类之母女娲，捏土造人、炼石补天，并帮人族收伏许多妖魔，自古为神州人民景仰。相传女娲曾为了救自己病故之爱女，将自己万年修为贯注于一颗昔日补天所馀的五彩玉石上，自此该灵石就具有特别之力。"},
    {6, "盘古斧", 1, 2, 10000, Weapon,.Attack=50,"传说天地混沌之初，盘古由睡梦醒来，见天地晦黯，遂拿一巨大之斧劈开天与地，自此才有我们之世界、宇宙。此斧拥有分天开地、穿梭太虚之力，威力不下轩辕剑。"},
    {7, "崆峒印", 1, 2, 10000, Armor,.Defence=50,"崆峒海上不死龙族的护守神器，其上刻塑有五方天帝形貌，并有玉龙盘绕。自古相传得到它的人，就能拥有天下，也有人传说它能让人不老不死。自古许多方士纷纷出海找寻此印，但最后都只是踏上不归之路。"},
    {8, "炼妖壶", 1, 2, 10000, Weapon,.Attack=50,"古称九黎壶，乃上古异宝之一。拥有不可思议之力，据说能造就一切万物，也有惊人之毁坏力量。内部有著奇异之空间，空间之大似能将天地收纳于内。"},
    {9, "伏羲琴", 1, 2, 10000, Weapon,.Attack=50,"伏羲以玉石加天丝所制出之乐器，泛著温柔的白色光芒，其琴音能使人心感到宁静祥和，据说拥有能支配万物心灵之神祕力量。"},
    {10, "昊天塔", 1, 2, 10000, Armor,.Defence=50,"原为天界重宝，拥有浩大无俦之力，据说能降一切妖魔邪道，必要时仙神也可降服；但后因不明原因而下落不明，无人知晓其下落。"},
    {11, "神农鼎", 1, 2, 10000, Con,.Power=125,"古称造世鼎，上古时代神农氏为苍生遍尝百草，也为后世奠定医学基础。神农昔日炼制百药之古鼎，正因积聚千年来无数灵药之气，据说能炼出天界诸神亦无法轻得之旷世神药，并隐藏其他神祕之力量。"},
    {12, "昆仑镜", 1, 2, 10000, Armor,.Defence=50,"仙人故乡昆仑山中的昆仑天宫中，传说有一面神镜，拥有自由穿梭时空之力。但在一次仙人之盛会中，神镜被人所偷，至今一直下落不明。"},
};
Map mapArray[8][8] = {
    {
        {1, "天山",   1, {0, 0}, "据《穆天子传》记载，3000年前的周朝穆王曾乘坐\"八骏马车\"西行天山，西王母在天池接见了他。穆王赠送大批锦绸美绢等中原特产，西王母则回赠了天山的奇珍瑰宝，并邀请穆王游览天山名胜。穆王亲书\"西王母之山\"，留作纪念。临别时，西王母劝饮再三，即席歌曰:\"祝君长寿，愿君再来。\""},
        {2, "楼兰",   1, {1, 0}, "东通敦煌，西北到焉耆、尉犁，西南到若羌、且末。古代“丝绸之路”的南、北两道从楼兰分道。"},
        {3, "白驼山", 1, {2, 0}, "这可是当年大魔头欧阳锋的发家之地。今天的白驼山却很安静。。。"},
        {4, "野猪林", 1, {3, 0}, "野猪林里到处都是野猪。。。嗖！嗖！嗖！搜！。。。四只小野猪围了过来。喝过8个巨无霸后，领头的野猪朗声道：俗套！"},
        {5, "水晶洞", 1, {4, 0}, "走进一个洞中，洞中的景色马上呈现在眼前，这里真是太美了。一低头，发现脚边有一块石碑，上面写着：水晶洞。"},
        {6, "天蚕洞", 1, {5, 0}, "天蚕洞满地蚕茧，满地飞蛾。噗噜噜！噗噜噜！拨开飞蛾，踢开蚕蛹。。。但见一绝色女尼正坐在你的面前@！@！闭眼闭眼！"},
        {7, "黑风寨", 1, {6, 0}, "黑风寨只有狂风在不停地吹。突然，一条东瀛狼狗疯狂地扑了上来，一阵乱咬。"},
        {8, "冰火岛", 1, {7, 0}, "冰火岛上只有火球、冰块。快跑，轰隆隆----火山爆发了！咦，怎么只有烟，没有火？"}
    },
    {
        {9, "迷宫",    1, {0, 1}, "这里是高昌迷宫，也是一个十分神秘的地方，连江湖阅历及其丰富的老侠客都不知道这会发生什么事情。"},
        {10, "凌霄城", 1, {1, 1}, "凌霄城只有哆嗦，没人。"},
        {11, "天界北岛", 1, {2, 1}, "天阶北岛主要以三大阁为主，三大阁实力雄厚，在天阶北岛没有任何势力能与之对抗，背后还有以上官家族为首的三大古老家族。另外有独立于三大阁之外的灵玉堂，执法堂等机构。整体实力在五大岛中相对较弱，但顶尖战力毫不逊色。"},
        {12, "华山",   1, {3, 1}, "自古华山一条路，只许上，不许撤。如同风景介绍一般，五岳派总舵岂是邪魔歪道们随便来去之地？不过如果是君子，那就大可放心了。"},
        {13, "嵩山",   1, {4, 1}, "在雄伟的嵩山上，有一个江湖上名声响亮的寺庙：少林寺。如果说桂林山水甲天下，那么少林武功甲天下并不为过。"},
        {14, "紫禁城", 1, {5, 1}, "大内高手云集的地方。谁要赶来这里闹事，得罪的不光是大内锦衣卫，还有当今的皇上。"},
        {15, "快活林", 1, {6, 1}, "快活林快活林，有钱才能快乐！"},
        {16, "神龙岛", 1, {7, 1}, "这一上岛来，就能听到不知是韦小宝还是周星驰发出的笑声：啊哈哈哈哈哈哈哈！！这就是神龙教的总舵：神龙岛了。"}
    },
    {
        {17, "西域",   1, {0, 2}, "西域大漠的风沙吹得人和牲畜都睁不开眼睛。这里没有水，没有树，没有草，死一般的像个地狱。"},
        {18, "天界南岛", 1, {1, 2}, "天阶南洲主体部分，因南岛及其附属岛屿面积和东洲一样要比其余岛屿的十倍还多，故而称为南洲。其中南州海域是人类活动范围，南岛是灵兽之岛，南岛上聚集了实力强大的灵兽一族，甚至强大后能化成人形。因得到天阶岛大部分宗派的认可，南岛的灵兽和人类具有同样的地位，不得随意杀害，整体实力仅次于东洲。现南岛由朱雀掌管，已跟中心合作。"},
        {19, "唐门",   1, {2, 2}, "这里是唐家堡，从外面看这只是一个大宅院，与其他的富家宅院没有什么两样，但却是藏龙卧虎之地。"},
        {20, "终南山", 1, {3, 2}, "这里是终南山，全真教总舵。两旁丛丛耸耸的长满了各种树木，大道的尽头出现一座道观，几个小道士边聊天边请扫道观。"},
        {21, "石窟",   1, {4, 2}, "这里是龙门石窟，一个个的石窟自有一种神秘感。"},
        {22, "客栈",   1, {5, 2}, "地处交通要道的龙门客栈可是名扬四海，老帮娘金香玉的名头也是世人皆知，今天她在店里吗？"},
        {23, "玉皇顶", 1, {6, 2}, "一个永远不会安定的地方：泰山玉皇顶。这里是一个充满着厮杀的地方，无时无刻不充斥着暴力、仇杀的地方。"},
        {24, "灵蛇岛", 1, {7, 2}, "到处都是蛇的岛，这就是灵蛇岛。在这里，恐怖的故事层出不穷，令人毛骨悚然。不过要是喜欢吃蛇的人来到这里，可是该高兴死了。"}
    },
    {
        {25, "光明顶", 1, {0, 3}, "所谓三十六峰者，骈列舒张，横绝天表，众岫叠岭，效奇献秀，尽在一览。"},
        {26, "天阶西岛", 1, {1, 3}, "天阶岛上的女性修炼者正常情况都集中在天阶西岛。岛上至今仍然保留着上古母系氏族的遗风，一切都由女人当家做主。不过这些女修的实力都非常强大，丝毫不在其他天阶岛势力之下。"},
        {27, "聚贤庄", 1, {2, 3}, "聚贤庄大家今日都很忙。虽然现在没人，不过无所谓！"},
        {28, "天阶中岛",   1, {3, 3}, "各大商会总部云集的天阶中岛位于五大天阶岛的中心，犹如古代繁华的大都城，有雪剑派、千刃派等门派。中岛不像其它岛那样女性修炼者都集中到西岛，而是女性修炼者也很多。岛主，副岛主只是长老会的代言人，巨头境高手一般隐世不出。"},
        {29, "武当山", 1, {4, 3}, "武当山只有火工道人在打盹。红卫兵刚刚来过！道士全都拉走批斗了！"},
        {30, "开封府", 1, {5, 3}, "宋朝时的都城，因有包青天而世人皆知。同时也是武林人士活动的要地。"},
        {31, "二十四桥", 1, {6, 3}, "今天没人乐意走二十四桥，不如坐下来喝点茶，寂寞高手嘛！"},
        {32, "蓬莱仙境", 1, {7, 3}, "云雾缭绕的蓬莱仙境自古以来都似乎隐藏着天大的秘密，谁能真正揭开这里的迷呢？也许你可以，也许他额可以。"}
    },
    {
        {33, "擂鼓山", 1, {0, 4}, "这里是擂鼓山，一点也想不到这座山为什么要起这个名字，看到的是这么美丽的景致，听到的却是个并不美丽的名字。"},
        {34, "峨眉山", 1, {1, 4}, "峨眉金顶只有几个扫山尼姑。尼姑当然寂寞！寂寞的人当然想说话！说了乱七八糟后，并没有提供什么有用的信息。"},
        {35, "天阶东岛", 1, {2, 4}, "天阶东洲的主体部分。面积与南岛一样广袤无垠，乃是五大天阶岛中最为强大的一个岛，但也是最为危险的一个岛。高手如云，天才云集，拥有众多顶尖修炼学院，还有隐杀门，极乐谷等势力。是所有修炼者求之不得的修炼之地。"},
        {36, "五虎岭", 1, {3, 3}, "五虎岭素以五条猛虎闻名，每年都有许多不自量力的捕虎人成群进入，但从来都是一去无回，五虎真的如此厉害？"},
        {37, "天宁寺", 1, {4, 4}, "佛家地天宁寺，每天前来进香之人络绎不绝。可从进香之人求愿灵验的程度上让人不得不产生怀疑。"},
        {38, "积善堂", 1, {5, 4}, "积善堂今天没卖出一张彩票。此时已是深夜，不如早些睡了吧！"},
        {39, "镇江府", 1, {6, 4}, "从两百里以外就可以闻到一股酸味，这就是镇江府，盛产镇江醋。"},
        {40, "桃花岛", 1, {7, 4}, "桃花岛今天没人来偷桃，愉快的花工正躺在花下。"}
    },
    {
        {41, "恶人谷",     1, {0, 5}, "恶人善人都不在谷里。只有小鱼儿在睡觉！这家伙，抗倭一点都不积极。"},
        {42, "大理",       1, {1, 5}, "大理城里只有大理平民，平民最好打交道!"},
        {43, "百花谷",     1, {2, 5}, "哇，这里太美了，这里的很多花都叫不上名字！"},
        {44, "孔雀山庄",   1, {3, 5}, "这里金湖碧波荡漾，典型的傣式建筑掩映在茂密的森林之中，孔雀争相开屏、鸵鸟欢唱迎宾，梅花鹿湖畔戏水，人与自然和谐相融。"},
        {45, "五霸岗",     1, {4, 5}, "如果有人问：哪里能交上武林朋友？那答案肯定是五霸岗。此地虽怪石嶙峋、寸草不生，但却是天下英雄汇聚的地方。"},
        {46, "万仞堂",     1, {5, 5}, "万仞堂，顾名思义，十八般兵刃样样俱全。最近该堂还搞了点副业，外卖防具、药丸，有意者敬请光顾。"},
        {47, "栖霞古刹",   1, {6, 5}, "栖霞古刹今天没人来拜佛，倭寇究竟在哪里呢？不仅仰天长叹。"},
        {48, "六合塔",     1, {7, 5}, "六合塔里阴森森的。空调可够足的！"}
    },
    {
        {49, "玩偶山庄", 1, {0, 6}, "来到了玩偶山庄，这里好像什么东西都与其他地方有些不同，这是一个十分特别的地方，不知进庄之后还能有什么与众不同的东西。"},
        {50, "黑木崖", 1, {1, 6}, "黑木崖今天没人来会任我行。突然间，飞来一只黑鸽，徐徐盘旋而下。"},
        {51, "蝴蝶谷", 1, {2, 6}, "为何蝴蝶谷中会有如此众多的蝴蝶？是不是因为发生了什么不可告人的事情？看来只有有缘人才能知道了。"},
        {52, "铁花堡", 1, {3, 6}, "神秘的铁花堡，曾经是飞龙帮在三百年前的总舵。自从飞龙帮最后一任帮主争夺武林盟主失败自杀后，如今已是一片凋零。如今的铁花堡，多的是制造铁工艺品的工匠。"},
        {53, "霹雳堂", 1, {4, 6}, "江湖雷家曾把这里建立成唯一可以与唐门暗器抗衡的雷家火器大本营。"},
        {54, "关帝庙", 1, {5, 6}, "一到关帝庙，就会看到无数乞丐。他们虽乞讨，但真实的任务却是习武练功，除暴安良。"},
        {55, "麒麟庄", 1, {6, 6}, "麒麟庄的人都被麒麟给吓跑了。"},
        {56, "销魂宫", 1, {7, 6}, "销魂宫现在没人消化灵魂。不如跟小姐们聊聊！群中的眼睛是雪亮的！头牌秦可卿柔声道：大兄弟做个大保健吧！"}
    },
    {
        {57, "石府",   1, {0, 7}, "天机石府里只有石头。石头当然不会是乱放的。可惜，石头太多怎么办？"},
        {58, "金三角", 1, {1, 7}, "金三角里看来没有别人。只有只老狗悻悻的靠在罂粟田头吸着什么。。。"},
        {59, "忏悔崖", 1, {2, 7}, "忏悔崖上没人在忏悔，却有人在宣传倭寇！"},
        {60, "通吃岛", 1, {3, 7}, "通吃岛上只有“此岛危险！当心被吃”几个字。"},
        {61, "通天观", 1, {4, 7}, "一个普普通通、其貌不扬的小小通天观，有意者都可以进来玩玩。观内有一颗很高的大树，从来没有人能够爬到树顶。据说它是通天的。"},
        {62, "紫霞亭", 1, {5, 7}, "紫霞亭现在空着，亭中有一盘棋。棋子不合棋法，但对你却有用！"},
        {63, "天弃庵", 1, {6, 7}, "天弃庵是空空荡荡的小尼姑庵。我想进去，但人家不让。"},
        {64, "侠客岛", 1, {7, 7}, "侠客岛没人钻研侠客神功。卖门票的女子百无聊赖。"}
    }
};
Player *currPlayer = NULL;
/* 初始化游戏数据 */
void Init()
{
    //默认当前登入玩家为玩家1
    currPlayer = &players[0];
    players[0].weapon = propArray[0];
    players[0].armor = propArray[1];
    players[0].martial = martials[13];
}
/* 显示全局数据 */
void Show()
{
    int propCount = sizeof(propArray) / sizeof(Prop);
    int i;
    for(i = 0;i < propCount; i++)
    {
        printf("%d\t%s\t%d\t",propArray[i].id,propArray[i].name,propArray[i].price);
        switch(propArray[i].type)
        {
        case Weapon://武器
            printf("攻击力%d\n",propArray[i].Attack);
            break;
        case  Armor://防具
            printf("防御力%d\n",propArray[i].Defence);
            break;
        case Con://消耗品
            printf("增益值%d\n",propArray[i].Power);
            break;
        case Card://卡片
            break;
        case Frag://碎片
            break;
        default : break;
        }
    }
}
/* 显示游戏的框框 */
void ShowWelcome()
{
    for(int i=1;i<=41;i++)
    {
        SetPosition(0,i);
        printf("|");
        SetPosition(79,i);
        printf("|");
    }
    SetPosition(1,0);
    printf("%s",SEP);
    SetPosition(36,2);
    printf("百鬼夜行");
    SetPosition(1,4);
    printf("%s",SEP);
    SetPosition(1,22);
    printf("%s",SEP);
    SetPosition(1,32);
    printf("%s",SEP);
    SetPosition(1,42);
    printf("%s",SEP);
}
/* 显示游戏地图 */
void ShowMap()
{
    int i,j;
    for(i=0;i<8;i++)
    {
    SetPosition(6,6+2*i);
    for(j=0;j<8;j++)
    {
        if(j==X && i==Y)
        {
            SetColor(12,7);
            printf("%-9s",mapArray[i][j].name);
            SetColor(10,0);
        }
        else
        printf("%-9s",mapArray[i][j].name);
    }
    }
    ShowMapInfo();
}
/* 在信息界面显示当前地图的信息 */
void ShowMapInfo()
{
    Clear(1,23,9);
    SetPosition(28,23);
    printf("当前所在地图:《%s》",mapArray[Y][X].name);
    int i;
    int len=strlen(mapArray[Y][X].desc);
    SetPosition(4,25);
    for(i=0;i<len;i++)
    {
        if(i != 0 && i%72==0)
        SetPosition(4,25+i/72);
        printf("%c",mapArray[Y][X].desc[i]);
    }
}
/* 显示地图下方的信息框 */
void ShowInfomation()
{
}
/* 显示游戏的主菜单 */
void ShowMainMenu()
{
    SetPosition(2,33);
    printf("1.查看人物状态");
    SetPosition(2,34);
    printf("2.查看背包");
    SetPosition(2,35);
    printf("3.探索地区");
    SetPosition(2,36);
    printf("4.进入商城");
    SetPosition(2,37);
    printf("5.返回主城");
    SetPosition(2,38);
    printf("5.奖励制作者~嘟嘟噜~");
}
/* 在信息界面显示玩家的个人资料 */
void ShowPlayerInfo()
{
    Clear(1,23,9);
    SetPosition(30,23);
    printf("幽魂《%s》的信息",currPlayer->name);
    SetPosition(50,24);
    printf("LV:%d  EXP:%d",currPlayer->level,currPlayer->exp);
    SetPosition(12,25);
    printf("生命:%d\t魔力:%d\t\t金币:%d",currPlayer->hp,currPlayer->mp,currPlayer->gold);
    SetPosition(12,27);
    printf("当前武器:%s(Lv.%d)\t\t当前攻击力:%d",currPlayer->weapon.name,currPlayer->weapon.level,currPlayer->weapon.Attack);
    SetPosition(12,29);
    printf("当前防具:%s(Lv.%d)\t\t当前防御力:%d",currPlayer->armor.name,currPlayer->armor.level,currPlayer->armor.Defence);
    SetPosition(34,31);
    printf("按回车继续");
    getchar();

}
/* 显示玩家背包信息 */
void ShowBag()
{
    /* 显示背包已有商品信息 */
    Clear(1,23,9);
    SetPosition(25,23);
    printf("幽魂《%s》的背包",currPlayer->name);
    SetPosition(10,25);
    char key;//用于选择商品
    int p=0;  //用于商翻页
    //先获得商城的道具数量
    int PropCount = currPlayer->bag.count;
    PropCount = 36;
    for(int i=0;;i++)
    {
        if(PropCount==0)
        {
            SetPosition(20,26);
            printf("当前背包为空(按回车返回)");
            getchar();
            return;
        }
        if(i%3==0)
            SetPosition(10,25+2*((i-p*9)/3));
        printf("%d.%s(数量:%d)  \t",i+1,currPlayer->bag.props[i].name,currPlayer->bag.props[i].stock);
        if((i!=0 && (i+1)%9==0) || (i+1)==PropCount )
        {
            SetPosition(56,31);
            printf("%d/%d页    - + 翻页",p+1,PropCount/9 + 1);
            SetPosition(10,31);
            printf("请选择道具(按0离开):");
            key=getch();
            if(key=='0') return;
            if(key>='1' && key<='9')
            {
                Clear(1,23,9);
                SetPosition(30,23);
                printf("《%s》    %d金",currPlayer->bag.props[key-49].name,currPlayer->bag.props[key-49].price);
                int j;
                char n;
                int len=strlen(currPlayer->bag.props[key-49].desc);
                SetPosition(10,25);
                for(j=0;j<len;j++)
                {
                    if(j != 0 && j%60==0)
                    SetPosition(10,25+j/60);
                    printf("%c",currPlayer->bag.props[key-49].desc[j]);
                }
                SetPosition(10,31);
                printf("    任意键返回");
                n=getch();
                //if(n=='1')
                Clear(1,23,9);
                SetPosition(25,23);
                printf("幽魂《%s》的背包",currPlayer->name);
                i = p*9-1;
            }
                else if(key == '-')//左
                    {
                        if(p>0)
                            --p;
                        Clear(1,23,9);
                        SetPosition(25,23);
                        printf("幽魂《%s》的背包",currPlayer->name);
                        i = p*9-1;
                    }
                else if(key == '+')//右
                    {
                        if(p<PropCount/9)
                            ++p;
                        Clear(1,23,9);
                        SetPosition(25,23);
                        printf("幽魂《%s》的背包",currPlayer->name);
                        i = p*9-1;
                    }
        }
    }
}
/* 显示地图的怪物 */
void ShowMonsters()
{

    //(怪物等级数组)char * levelnames = {""};
    //清楚信息
    Clear(1,23,9);
    //先获得地图的怪物总数
    int monsterCount = sizeof(monsterArray) / sizeof(Monster);
    int monsterIndexs[9];   //当前地图的怪物下标数组
    int currMapMonsterCount = 0;        //当前地图的怪物总数
    int i;
    for(i=0;i<monsterCount;i++)
    {
        //查找当前地图的怪物总数
        if(monsterArray[i].coord.X==X && monsterArray[i].coord.Y==Y &&monsterArray[i].state!=0)
        {
            monsterIndexs[currMapMonsterCount] = i;
            currMapMonsterCount++;
            if(currMapMonsterCount == 9)
                break;
        }
    }
    //打印怪物
    SetPosition(29,23);
    if(currMapMonsterCount == 0)
    {
        printf("当前地图冷冷清清的！");
        SetPosition(34,31);
        printf("按回车继续");
        getchar();
        return;
    }
    else
    {
        SetPosition(10,23);
        printf("当前地图出现了如下怪物:");
        SetPosition(10,25);
        for(i=0;i < currMapMonsterCount;i++)
        {
            if(i%3==0 && i!=0)
            {
                SetPosition(10,25+i/3);
            }
            printf("%d.%s(%d级)\t",i+1,monsterArray[monsterIndexs[i]].name,monsterArray[monsterIndexs[i]].level);
        }
    }
    //选择要pk的怪物编号，调用finght函数
    int pkMonsterId = -1;
    for(;;)
    {
        SetPosition(10,29);
        printf("请输入要攻击的对象(按0返回):");
        scanf("%d",&pkMonsterId);
        getchar();
        if(pkMonsterId==0)
            return;
        if(pkMonsterId>0 && pkMonsterId<=currMapMonsterCount)
            break;
        else
        {
            SetPosition(10,29);
            printf("输入的攻击对象下标有误，请重新输入(按回车继续)");
            getchar();
            Clear(1,29,1);
        }
    }
    Fight(&monsterArray[monsterIndexs[pkMonsterId-1]]);
}
/* 刷怪的方法 */
void Fight(Monster *monster)
{
    int MonsterHp = monster->hp;
    int PlayerHp = currPlayer->hp;
    SetPosition(10,30);
    for(;;)
    {
        //回合制战斗。。。。
        //伤害值等于攻击力/（攻击力+防御力）
        //怪物收到伤害:currPlayer->weapon.Attack-monster->def
        //玩家收到伤害:monster->att-currPlayer->armor.Defence
        //默认玩家优先攻击
        if(currPlayer->weapon.Attack <= monster->def)
            MonsterHp-=1;
        else
        MonsterHp = MonsterHp - (currPlayer->weapon.Attack - monster->def);
        if(MonsterHp<=0)
        {
            currPlayer->exp = currPlayer->exp + monster->exp;
            currPlayer->gold = currPlayer->gold + monster->Money;
            monster->state=0;
            break;
        }
        if(monster->att <= currPlayer->armor.Defence)
            currPlayer->hp -=1;
        else
        currPlayer->hp = currPlayer->hp - (monster->att - currPlayer->armor.Defence);
        if(currPlayer<=0)
        {
            SetPosition(10,30);
            printf("你已死亡！输入回车返回城镇~");
            currPlayer->hp = 1;
            getchar();
            return;
        }
    }
    SetPosition(10,30);
    printf("《%s》被你打败,损失%d点生命值,获得经验%d,金币%d.",monster->name,PlayerHp - currPlayer->hp,monster->exp,monster->Money);
    SetPosition(34,31);
    printf("按回车继续");
    getchar();
    ShowMonsters();
}
/* 返回城镇 */
void Move(int x,int y)
{
    X=x;
    Y=y;
    ShowMap();
}
/* 显示商城已有商品信息 */
void ShowShop()
{
    /* 显示商城已有商品信息 */
    Clear(1,23,9);
    SetPosition(20,23);
    printf("欢迎来到《镇魂街》——阴阳界的交汇处");
    SetPosition(10,25);
    char key;//用于选择商品
    int p=0;  //用于商城翻页
    //先获得商城的道具数量
    int PropCount = sizeof(propArray) / sizeof(Prop);
    for(int i=0;;i++)
    {
        if(i%3==0)
            SetPosition(10,25+2*(i-p*9)/3);
        printf("%d.%s(库存:%d)  \t",i+1,propArray[i].name,propArray[i].stock);
            if((i!=0 && (i+1)%9==0) || i==PropCount-1 )
            {
                SetPosition(56,31);
                printf("%d/%d页    - + 翻页",p+1,PropCount/9 + 1);
                SetPosition(10,31);
                printf("请选择道具(按0离开):");
                key=getch();
                if(key=='0') return;
                if(key>='1' && key<='9')
                {
                    Clear(1,23,9);
                    SetPosition(30,23);
                    printf("《%s》    %d金",propArray[key-49].name,propArray[key-49].price);
                    int j;
                    char n;
                    int len=strlen(propArray[key-49].desc);
                    SetPosition(10,25);
                    for(j=0;j<len;j++)
                    {
                    if(j != 0 && j%60==0)
                        SetPosition(10,25+j/60);
                        printf("%c",propArray[key-49].desc[j]);
                    }
                    SetPosition(10,31);
                    printf("1购买    任意键返回");
                    n=getch();
                    if(n=='1')
                    Shopping(&propArray[key-49]);
                    Clear(1,23,9);
                    SetPosition(20,23);
                    printf("欢迎来到《镇魂街》——阴阳界的交汇处");
                    i = p*9-1;

                }
                else if(key == '-')//左
                    {
                        if(p>0)
                            p--;
                        Clear(1,23,9);
                        SetPosition(20,23);
                        printf("欢迎来到《镇魂街》——阴阳界的交汇处");
                        i = p*9-1;

                    }
                else if(key == '+')//右
                    {
                        if(p<PropCount/9)
                            p++;
                        Clear(1,23,9);
                        SetPosition(20,23);
                        printf("欢迎来到《镇魂街》——阴阳界的交汇处");
                        i = p*9-1;
                    }
            }
    }
}
/* 商城交易 */
void Shopping(Prop *prop)
{
    //判断有没有库存
    if(prop->stock==0)
    {
        Clear(1,23,9);
        SetPosition(30,26);
        printf("该商品库存不足");
        getchar();
        return;
    }
    //判断金币是否充足
    if(currPlayer->gold<prop->price)
    {
        Clear(1,23,9);
        SetPosition(30,26);
        printf("金币不足");
        getchar();
        return;
    }
    //判断背包是否有空余
    if(currPlayer->bag.count==currPlayer->bag.max)
    {
        Clear(1,23,9);
        SetPosition(30,26);
        printf("背包空间不足");
        getchar();
        return;
    }
    //判断完之后开始交易
    //商品库存减一
    prop->stock-=1;
    //玩家金币减少
    currPlayer->gold-=prop->price;
    //玩家背包道具加一
    int i;
    for(i=0;i<currPlayer->bag.count;i++)
    {
        if(currPlayer->bag.props[i].id==prop->id)
        {
                currPlayer->bag.props[i].stock+=1;
                break;
        }
    }
    if(i==currPlayer->bag.count)
    {
        currPlayer->bag.props[i]=*prop;
        currPlayer->bag.props[i].stock=1;
        currPlayer->bag.count++;
    }
}
/* 商城 */
void Shop()
{
    ShowShop();
}
/* 处理用户的菜单选项 */
void ProcessMainMenu(char key)
{
    switch(key)
    {
    case '1':
        ShowPlayerInfo();
        break;
    case '2':
        ShowBag();
        break;
    case '3':
        ShowMonsters();
        break;
    case '4':
        Shop();
        break;
    case '5':
        Move(currPlayer->martial.hqCoord.X,currPlayer->martial.hqCoord.Y);
        break;
    }
}





























































